ua1arn/hftrx/lib/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
  /* Decode endpoint IN and OUT address from interface descriptor */
  for (num = 0U; num < max_ep; num++)
  {
    if ((phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress & 0x80U) != 0U)
    {
      phhid->InEp = (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress);
      phhid->InPipe = USBH_AllocPipe(phost, phhid->InEp);

      /* Open pipe for IN endpoint */
      (void)USBH_OpenPipe(phost, phhid->InPipe, phhid->InEp,
    		  & phhid->target, USB_EP_TYPE_INTR, phhid->length);

      (void)USBH_LL_SetToggle(phost, phhid->InPipe, 0U);
    }
    else
    {
      phhid->OutEp = (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[num].bEndpointAddress);
      phhid->OutPipe  = USBH_AllocPipe(phost, phhid->OutEp);

      /* Open pipe for OUT endpoint */
      (void)USBH_OpenPipe(phost, phhid->OutPipe, phhid->OutEp,
    		  & phhid->target, USB_EP_TYPE_INTR, phhid->length);

      (void)USBH_LL_SetToggle(phost, phhid->OutPipe, 0U);
    }
  }

  return USBH_OK;
}

/**
  * @brief  USBH_HID_InterfaceDeInit
  *         The function DeInit the Pipes used for the HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit(USBH_HandleTypeDef *phost)
{
  HID_HandleTypeDef *phhid = (HID_HandleTypeDef *) phost->pActiveClass->pData;

  if (phhid->InPipe != 0x00U)
  {
    (void)USBH_ClosePipe(phost, phhid->InPipe);
    (void)USBH_FreePipe(phost, phhid->InPipe);
    phhid->InPipe = 0U;     /* Reset the pipe as Free */
  }

  if (phhid->OutPipe != 0x00U)
  {
    (void)USBH_ClosePipe(phost, phhid->OutPipe);
    (void)USBH_FreePipe(phost, phhid->OutPipe);
    phhid->OutPipe = 0U;     /* Reset the pipe as Free */
  }

  if ((phost->pActiveClass->pData) != NULL)
  {
    //USBH_free(phost->pActiveClass->pData);
    phost->pActiveClass->pData = 0U;
  }

  return USBH_OK;
}

/**
  * @brief  USBH_HID_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for HID class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost)
{

  USBH_StatusTypeDef status         = USBH_BUSY;
  USBH_StatusTypeDef classReqStatus = USBH_BUSY;
  HID_HandleTypeDef *phhid = (HID_HandleTypeDef *) phost->pActiveClass->pData;

  /* Switch HID state machine */
  switch (phhid->ctl_state)
  {
    case HID_REQ_INIT:
    case HID_REQ_GET_HID_DESC:

      USBH_HID_ParseHIDDesc(&phhid->HID_Desc, phost->device.CfgDesc_Raw);

      phhid->ctl_state = HID_REQ_GET_REPORT_DESC;

      break;
    case HID_REQ_GET_REPORT_DESC:

      /* Get Report Desc */
      classReqStatus = USBH_HID_GetHIDReportDescriptor(phost, phhid->HID_Desc.wItemLength);
      if (classReqStatus == USBH_OK)
      {
        /* The descriptor is available in phost->device.Data */
    	  USBH_UsrLog("Control: HID: Device Get Report Descriptor request success");
        phhid->ctl_state = HID_REQ_SET_IDLE;
      }
      else if (classReqStatus == USBH_NOT_SUPPORTED)
      {
        USBH_ErrLog("Control error: HID: Device Get Report Descriptor request failed");
        status = USBH_FAIL;
      }
      else
      {
        /* .. */
      }

      break;

    case HID_REQ_SET_IDLE:

      classReqStatus = USBH_HID_SetIdle(phost, 0U, 0U);

      /* set Idle */
      if (classReqStatus == USBH_OK)
      {
        USBH_UsrLog("Control: HID: Device Set Idle request success");
        phhid->ctl_state = HID_REQ_SET_PROTOCOL;
      }
      else
      {
        if (classReqStatus == USBH_NOT_SUPPORTED)
        {
         USBH_ErrLog("Control error: HID: Device Set Idle request not supported");
         phhid->ctl_state = HID_REQ_SET_PROTOCOL;
        }
      }
      break;

    case HID_REQ_SET_PROTOCOL:
      /* set protocol */
      classReqStatus = USBH_HID_SetProtocol(phost, 0U);
      if (classReqStatus == USBH_OK)
      {
        phhid->ctl_state = HID_REQ_IDLE;

        USBH_UsrLog("Control: HID: Device Set protocol request success");
       /* all requests performed*/
        phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
        status = USBH_OK;
      }
      else if (classReqStatus == USBH_NOT_SUPPORTED)
      {
        USBH_ErrLog("Control error: HID: Device Set protocol request failed");
        status = USBH_FAIL;
      }
      else
      {
        /* .. */
      }
      break;

    case HID_REQ_IDLE:
    default:
      break;
  }

  return status;
}

/**
  * @brief  USBH_HID_Process
  *         The function is for managing state machine for HID data transfers
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost)
 {
	USBH_StatusTypeDef status = USBH_OK;
	USBH_URBStateTypeDef statusURB;
	HID_HandleTypeDef *phhid =
			(HID_HandleTypeDef*) phost->pActiveClass->pData;
	uint32_t XferSize;

	switch (phhid->state) {
	case HID_INIT:
		phhid->Init(phost);
		phhid->state = HID_IDLE;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_IDLE:
		status = USBH_HID_GetReport(phost, 0x01U, 0U, phhid->pHidReportData,
				(uint8_t) phhid->length);
		if (status == USBH_OK) {
			phhid->state = HID_SYNC;
		} else if (status == USBH_BUSY) {
			phhid->state = HID_IDLE;
			status = USBH_OK;
		} else if (status == USBH_NOT_SUPPORTED) {
			phhid->state = HID_SYNC;
			status = USBH_OK;
		} else {
			phhid->state = HID_ERROR;
			status = USBH_FAIL;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_SYNC:
		/* Sync with start of Even Frame */
		if ((phost->Timer & 1U) != 0U) {
			phhid->state = HID_GET_DATA;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

